-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: quotation_system
-- ------------------------------------------------------
-- Server version	8.0.3-rc-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `orderdetails`
--

DROP TABLE IF EXISTS `orderdetails`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `orderdetails` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `orderId` int(11) NOT NULL,
  `productId` int(11) NOT NULL,
  `productName` varchar(45) DEFAULT NULL,
  `productCategory` int(11) DEFAULT NULL,
  `productUnit` varchar(45) DEFAULT NULL,
  `productCost` decimal(16,2) DEFAULT '0.00',
  `productPrice` decimal(16,2) DEFAULT '0.00',
  `productCount` int(11) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `orderInfo_idx` (`orderId`),
  CONSTRAINT `orderInfo` FOREIGN KEY (`orderId`) REFERENCES `orders` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=349 DEFAULT CHARSET=gb2312;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orderdetails`
--

LOCK TABLES `orderdetails` WRITE;
/*!40000 ALTER TABLE `orderdetails` DISABLE KEYS */;
INSERT INTO `orderdetails` VALUES (55,23,85,'iphone 5s',4,'台',2000.00,6000.00,2),(56,23,86,'华为p10',4,'台',1500.00,4200.00,2),(57,23,87,'Macbook',5,'台',5000.00,9920.00,1),(58,23,88,'MacbookPro',5,'台',6000.00,14000.00,1),(59,23,89,'小米（MI）电视',6,'台',500.00,1208.90,1),(60,23,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,3358.80,1),(61,23,91,'可乐',7,'瓶',2.00,3.06,1000),(62,23,92,'雪碧',7,'瓶',2.00,3.06,1500),(63,23,93,'卫龙辣条',8,'袋',1.00,2.60,800),(64,23,94,'旺旺仙贝',8,'袋',1.00,3.12,20),(65,23,95,'INSCRIPTION',48,'套',100.00,327.80,20),(66,23,96,'雅诚德陶瓷小清新碗碟套装',48,'套',10.00,40.56,1),(67,23,97,'夹克外套',50,'件',50.00,114.00,1),(68,23,98,'七匹狼短袖T恤',50,'件',50.00,232.70,2),(69,23,99,'罗蒙（ROMON）西裤',51,'条',50.00,208.60,10),(70,23,100,'花花公子（PLAYBOY）休闲裤男',51,'条',80.00,238.50,1),(71,24,85,'iphone 5s',4,'台',2000.00,6000.00,1),(72,24,86,'华为p10',4,'台',1500.00,4200.00,1),(73,24,87,'Macbook',5,'台',5000.00,9920.00,1),(74,24,88,'MacbookPro',5,'台',6000.00,14000.00,1),(75,24,89,'小米（MI）电视',6,'台',500.00,1208.90,1),(76,24,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,3358.80,1),(77,24,97,'夹克外套',50,'件',50.00,114.00,1),(78,24,98,'七匹狼短袖T恤',50,'件',50.00,232.70,1),(79,24,99,'罗蒙（ROMON）西裤',51,'条',50.00,208.60,1),(80,24,100,'花花公子（PLAYBOY）休闲裤男',51,'条',80.00,238.50,1),(87,25,91,'可乐',7,'瓶',2.00,3.06,10),(88,25,92,'雪碧',7,'瓶',2.00,3.06,50),(89,25,93,'卫龙辣条',8,'袋',1.00,2.60,200),(90,25,94,'旺旺仙贝',8,'袋',1.00,3.12,1),(91,25,95,'INSCRIPTION',48,'套',100.00,327.80,1),(92,26,97,'夹克外套',50,'件',50.00,114.00,1),(93,26,98,'七匹狼短袖T恤',50,'件',50.00,232.70,1),(94,26,99,'罗蒙（ROMON）西裤',51,'条',50.00,208.60,1),(95,26,100,'花花公子（PLAYBOY）休闲裤男',51,'条',80.00,238.50,1),(102,29,85,'iphone 5s',4,'台',2000.00,5000.00,1),(103,29,86,'华为p10',4,'台',1500.00,3000.00,1),(104,29,87,'Macbook',5,'台',5000.00,8000.00,1),(105,29,88,'MacbookPro',5,'台',6000.00,10000.00,1),(106,29,89,'小米（MI）电视',6,'台',500.00,1099.00,1),(107,29,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,2799.00,1),(108,30,85,'iphone 5s',4,'台',2000.00,5000.00,1),(109,30,86,'华为p10',4,'台',1500.00,3000.00,1),(110,30,87,'Macbook',5,'台',5000.00,8000.00,1),(111,30,88,'MacbookPro',5,'台',6000.00,10000.00,1),(112,30,89,'小米（MI）电视',6,'台',500.00,1099.00,1),(113,30,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,2799.00,1),(114,30,91,'可乐',7,'瓶',2.00,3.00,1),(115,30,92,'雪碧',7,'瓶',2.00,3.00,1),(116,30,93,'卫龙辣条',8,'袋',1.00,2.50,1),(117,30,94,'旺旺仙贝',8,'袋',1.00,3.00,1),(198,41,85,'iphone 5s',4,'台',2000.00,5500.00,1),(199,41,86,'华为p10',4,'台',1500.00,3600.00,1),(200,41,87,'Macbook',5,'台',5000.00,8960.00,1),(201,41,88,'MacbookPro',5,'台',6000.00,12000.00,1),(202,41,89,'小米（MI）电视',6,'台',500.00,1153.95,1),(203,41,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,3078.90,1),(204,41,91,'可乐',7,'瓶',2.00,3.03,1),(205,41,92,'雪碧',7,'瓶',2.00,3.03,1),(206,41,93,'卫龙辣条',8,'袋',1.00,2.55,1),(207,41,94,'旺旺仙贝',8,'袋',1.00,3.06,1),(224,40,85,'iphone 5s',4,'台',2000.00,5500.00,10),(225,40,86,'华为p10',4,'台',1500.00,3600.00,1),(226,40,87,'Macbook',5,'台',5000.00,8960.00,1),(227,40,88,'MacbookPro',5,'台',6000.00,12000.00,1),(228,40,89,'小米（MI）电视',6,'台',500.00,1153.95,1),(229,40,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,3078.90,1),(230,40,91,'可乐',7,'瓶',2.00,3.03,1),(231,40,92,'雪碧',7,'瓶',2.00,3.03,1),(232,40,93,'卫龙辣条',8,'袋',1.00,2.55,1),(233,40,94,'旺旺仙贝',8,'袋',1.00,3.06,1),(234,42,85,'iphone 5s',4,'台',2000.00,5500.00,1),(235,42,86,'华为p10',4,'台',1500.00,3600.00,1),(236,42,87,'Macbook',5,'台',5000.00,8960.00,1),(237,42,88,'MacbookPro',5,'台',6000.00,12000.00,1),(238,42,89,'小米（MI）电视',6,'台',500.00,1153.95,1),(239,42,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,3078.90,1),(240,42,91,'可乐',7,'瓶',2.00,3.03,1),(241,42,92,'雪碧',7,'瓶',2.00,3.03,1),(242,42,93,'卫龙辣条',8,'袋',1.00,2.55,1),(243,42,94,'旺旺仙贝',8,'袋',1.00,3.06,1),(270,43,85,'iphone 5s',4,'台',2000.00,5500.00,1),(271,43,86,'华为p10',4,'台',1500.00,3600.00,1),(272,43,87,'Macbook',5,'台',5000.00,8960.00,1),(273,43,88,'MacbookPro',5,'台',6000.00,12000.00,1),(274,43,89,'小米（MI）电视',6,'台',500.00,1153.95,1),(275,43,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,3078.90,1),(284,46,85,'iphone 5s',4,'台',2000.00,5000.00,1),(285,46,86,'华为p10',4,'台',1500.00,3000.00,1),(286,46,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,2799.00,1),(287,46,91,'可乐',7,'瓶',2.00,3.00,1),(288,46,92,'雪碧',7,'瓶',2.00,3.00,1),(289,46,93,'卫龙辣条',8,'袋',1.00,2.50,1),(290,46,94,'旺旺仙贝',8,'袋',1.00,3.00,1),(291,45,85,'iphone 5s',4,'台',2000.00,5000.00,1),(292,45,86,'华为p10',4,'台',1500.00,3000.00,1),(293,45,89,'小米（MI）电视',6,'台',500.00,1099.00,1),(294,45,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,2799.00,1),(295,45,91,'可乐',7,'瓶',2.00,3.00,1),(296,45,92,'雪碧',7,'瓶',2.00,3.00,1),(297,45,93,'卫龙辣条',8,'袋',1.00,2.50,1),(298,45,94,'旺旺仙贝',8,'袋',1.00,3.00,1),(309,47,89,'小米（MI）电视',6,'台',500.00,1099.00,1),(310,47,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,2799.00,1),(311,44,87,'Macbook',5,'台',5000.00,8960.00,1),(312,44,88,'MacbookPro',5,'台',6000.00,12000.00,1),(313,44,89,'小米（MI）电视',6,'台',500.00,1153.95,1),(314,44,90,'海信（Hisense）LED55EC500U',6,'台',1000.00,3078.90,1),(315,44,91,'可乐',7,'瓶',2.00,3.03,1),(316,44,92,'雪碧',7,'瓶',2.00,3.03,1),(317,44,93,'卫龙辣条',8,'袋',1.00,2.55,1),(318,44,94,'旺旺仙贝',8,'袋',1.00,3.06,1),(319,48,91,'可乐',7,'瓶',2.00,3.00,1),(320,49,85,'iphone 5s',4,'台',2000.00,5000.00,1),(328,53,157,'旺旺仙贝',8,'袋',1.00,3.06,1),(329,53,158,'INSCRIPTION',48,'套',100.00,312.90,1),(343,55,154,'可乐',7,'瓶',2.00,3.03,1),(344,55,155,'雪碧',7,'瓶',2.00,3.03,1),(345,55,156,'卫龙辣条',8,'袋',1.00,2.55,1),(346,55,157,'旺旺仙贝',8,'袋',1.00,3.06,1),(347,55,158,'INSCRIPTION',48,'套',100.00,312.90,1),(348,55,159,'雅诚德陶瓷小清新碗碟套装',48,'套',10.00,39.78,1);
/*!40000 ALTER TABLE `orderdetails` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-04-18 15:51:05
